{"pageProps":{"article":{"id":"deploy-nextjs-app-to-github-pages","contentHtml":"<p>These last couple of days I've been wanting to create a simple and straight forward blog, to just keep the articles that I write and present myself. So I decided to do that using GitHub Pages and a simple NEXT.JS application, very similar to the one shown in the <a href=\"https://nextjs.org/learn/basics/create-nextjs-app\">official tutorial</a>. <strike>It suprised me how little and misleading information I found on how to do that, so I'm writing this.</strike> While making this guide I found a video that explains a similar approach to what I did and it's worth taking a look at it! <a href=\"https://www.youtube.com/watch?v=yRz8D_oJMWQ\">You can check it out here</a>. It would have save me some effort finding this earlier.</p>\n<h2>Conditions</h2>\n<p>Before we start, there are cases where this is not going to be possible so I want to save you the trouble of going through all of this just to get a disgusting suprise at the end.</p>\n<p>We are going to depend on the output of <code>next export</code>, so it is important that the application that you want to deploy is able to use it.</p>\n<blockquote>\n<ul>\n<li>\n<p>With <code>next export</code>, we build an HTML version of your app. At export time, we call <code>getStaticProps</code> for each page that exports it, and pass the result to the page's component. It's also possible to use the older <code>getInitialProps</code> API instead of <code>getStaticProps</code>, but it comes with a few caveats:</p>\n<ul>\n<li><code>getInitialProps</code> cannot be used alongside <code>getStaticProps</code> or <code>getStaticPaths</code> on any given page. If you have dynamic routes, instead of using <code>getStaticPaths</code> you'll need to configure the <code>exportPathMap</code> parameter in your <code>next.config.js</code> file to let the exporter know which HTML files it should output.</li>\n<li>When <code>getInitialProps</code> is called during export, the <code>req</code> and <code>res</code> fields of its <code>context</code> parameter will be empty objects, since during export there is no server running.</li>\n<li><code>getInitialProps</code> <strong>will be called on every client-side navigation</strong>, if you'd like to only fetch data at build-time, switch to <code>getStaticProps</code>.</li>\n<li><code>getInitialProps</code> should fetch from an API and cannot use Node.js-specific libraries or the file system like <code>getStaticProps</code> can.</li>\n</ul>\n</li>\n<li>\n<p>It's recommended to use and migrate towards <code>getStaticProps</code> over <code>getInitialProps</code> whenever possible.</p>\n</li>\n<li>\n<p>The <code>fallback: true</code> mode of <code>getStaticPaths</code> is not supported when using <code>next export</code>.</p>\n</li>\n<li>\n<p>API Routes are not supported by this method because they can't be prerendered to HTML.</p>\n</li>\n<li>\n<p><code>getServerSideProps</code> cannot be used within pages because the method requires a server. Consider using <code>getStaticProps</code> instead.</p>\n</li>\n<li>\n<p>Internationalized Routing is not supported as it requires Next.js' server-side routing.</p>\n</li>\n<li>\n<p>The <code>next/image</code> component's default loader is not supported when using <code>next export</code>. However, other loader options will work.</p>\n</li>\n</ul>\n</blockquote>\n<p>You can read <a href=\"https://nextjs.org/docs/advanced-features/static-html-export\">here</a> for more information.</p>\n<p>I will assume that you already have a NEXT.JS app. In order to test if your app will work, go to the <code>package.json</code> and add an <code>export</code> script to the <code>scripts</code> section. It should look something like this:</p>\n<pre><code>...\n\"scripts\": {\n    \"dev\": \"next dev\",\n    \"build\": \"next build\",\n    \"export\": \"next export\",\n    \"start\": \"next start\"\n},\n...\n</code></pre>\n<p>And now if you run <code>npm run build &#x26;&#x26; npm run export</code> without problems, then your app is ready.</p>\n<h2>GitHub Repository</h2>\n<p>We can use an existent repository for a project site or we can create one for our user or organization site. You can read <a href=\"https://pages.github.com/\">here</a> for more information. The first one is a bit more complicated, but we will address the issues that might present later.</p>\n<p>I will also assume that the source code for the NEXT.JS app is on the root (/) directory of the <code>main</code> branch. If that is not the case for you, you will have to make some changes to the things we do to follow along.</p>\n<p>Let's create an orphan branch called <code>gh-pages</code> on our local repository and make sure that the staging area is empty. Then create an empty commit and push the branch to GitHub.</p>\n<pre><code>git checkout --orphan gh-pages\ngit reset\ngit commit --allow-empty -m \"Initial commit\"\ngit push --set-upstream origin gh-pages\n</code></pre>\n<p>Now we go to the <em>Settings</em> tab of our repository on GitHub, to the <em>Pages</em> section and select the branch <code>gh-pages</code> and the <em>/ (root)</em> directory, then we click <em>Save</em>.</p>\n<p>We could just push the result of the <code>export</code> to <code>gh-pages</code> manually every time we want to update the page. That will work, but it's too much work for every change we want to make and it requires a lot of manual intervention, so we also want this to be automated as much as possible.</p>\n<h2>GitHub Actions</h2>\n<p>Let's create a GitHub Action so every time we push our changes to <code>main</code>, we automatically deploy our app. You can read <a href=\"https://docs.github.com/en/actions/reference/events-that-trigger-workflows\">here</a> if you want to use a different trigger.</p>\n<p>We will use the <em>Node.js</em> template, you can find the updated one <a href=\"https://docs.github.com/en/actions/guides/building-and-testing-nodejs\">here</a>. Create a file called <em>gh-pages.deploy.yml</em> (you can actually name it whatever you want) under the <em>.github/workflows</em> directory.</p>\n<p>In that file we will modify the <em>Node.js</em> template to suit our needs into something like this.</p>\n<pre><code>name: Deploy to GitHub Pages\n\non:\n  push:\n    branches: [main]\n\njobs:\n  build:\n    runs-on: ubuntu-latest\n\n    strategy:\n      matrix:\n        node-version: [14.x]\n\n    steps:\n      - name: Get files\n        uses: actions/checkout@v2\n      - name: Use Node.js ${{ matrix.node-version }}\n        uses: actions/setup-node@v2\n        with:\n          node-version: ${{ matrix.node-version }}\n      - name: Install packages\n        run: npm ci\n      - name: Build project\n        run: npm run build\n      - name: Export static files\n        run: npm run export\n      - name: Add .nojekyll file\n        run: touch ./out/.nojekyll\n      - name: Deploy\n        uses: JamesIves/github-pages-deploy-action@4.1.1\n        with:\n          branch: gh-pages\n          folder: out\n</code></pre>\n<p>This file is a set of instructions for GitHub to run our tasks. Let's review it by parts.</p>\n<p>The first <code>name</code> is just to indicate the name of the workflow, you can change it to whatever you want.</p>\n<p>The <code>on</code> will specify when this workflow should be run. Here we are saying whenever we push to the main branch. You can modify this as needed by changing the branch name or even the trigger action, maybe you want this to be updated on PRs as well like it is on the template.</p>\n<p>Then we have <code>jobs</code>. This section will define the jobs that we want to run on the workflow, here we have just the <code>build</code>. Inside it we also specify the OS in which it will be ran, the Node versions and the steps. Unless you really need to change the OS, leave it on <code>ubuntu-latest</code>, you can read more about that <a href=\"https://docs.github.com/en/actions/using-github-hosted-runners/about-github-hosted-runners\">here</a>. I selected only the 14.x version of Node because that is what works better for me, but if your project needs a different version, then you can change it.</p>\n<p>The steps that we will use are quiet simple. On the first step, the checkout step, we get our code. The second step will setup NodeJS. The third one will install the packages with <em>npm</em>. The fourth one will build our project. The fifth will export the static files for <em>NEXT.JS</em>. The sixth step will create a <em>.nojekyll</em> file inside the directory with the exported files. The last step is extracted from <a href=\"https://github.com/marketplace/actions/deploy-to-github-pages\">here</a>. It will create a branch, <code>gh-pages</code> in our case, with the content of the <em>out</em> directory. You can modify that if you need to. The <code>name</code> tag is optional, but I think it is nicer to look at than just the plain command.</p>\n<p>IMPORTANT: keep the indentation of the YAML file, it relies on it (kind of like Python).</p>\n<p>You might be wondering what is the empty <em>.nojekyll</em> file that we created. Well, GitHub Pages works with the Jekyll engine (more information <a href=\"https://jekyllrb.com/docs/\">here</a>), so there are some directories that will be skipped automatically. Anything that starts with underscore or dot, won't be accessible. Since we need access to _<em>next</em> directory, then we need to bypass Jekyll and the way to do that is by adding that <em>.nojekyll</em> file.</p>\n<p>Now we can push our content to the repository and if we check the <em>Actions</em> tab on GitHub, we will see that our workflow is running. Once it's finished, if we go to the GitHub Pages URL (it will be https://YOUR_USERNAME.github.io or https://YOUR_USERNAME.github.io/YOUR_REPOSITORY) we will see our page. If it's a user site, then that's it! We should be able to navigate everything correctly. If it's a project site you might be seeing some issues with the images and static resources. We will fix that next.</p>\n<h2>Fixing the issues</h2>\n<p>For project sites these are the problems we will see:</p>\n<ul>\n<li>Images are not loading</li>\n<li>Navigation is not working</li>\n</ul>\n<p>To put it short, the reason why this is happening is because NEXT.JS expects to be under https://YOUR_USERNAME.github.io/ while we are under https://YOUR_USERNAME.github.io/YOUR_REPOSITORY. You can read more about this <a href=\"https://nextjs.org/docs/basic-features/static-file-serving\">here</a>, <a href=\"https://nextjs.org/docs/api-reference/next.config.js/cdn-support-with-asset-prefix\">here</a> and <a href=\"https://nextjs.org/docs/api-reference/next.config.js/basepath\">here</a>.</p>\n<p>To fix this we will make use of environment variables. On the example we can see on the NEXT.JS documentation, on the <em>CDN Supoport with Asset Prefix</em> section, it's using the <em>NODE_ENV</em> variable to check if we are on production. We could use something like that but in our case I prefer using the <em>NEXT_PUBLIC_BASE_PATH</em> variable.</p>\n<p>We have to first create a file on the root of our app called <code>next.config.js</code> and put this content inside:</p>\n<pre><code>module.exports {\n    basePath: process.env.NEXT_PUBLIC_BASE_PATH,\n    assetPrefix: process.env.NEXT_PUBLIC_BASE_PATH\n}\n</code></pre>\n<p>Then on the YAML file (the one we named <code>gh-pages.deploy.yml</code> earlier), we have to add that variable and initialize it with our repository name.</p>\n<pre><code>...\njobs:\n  build:\n    runs-on: ubuntu-latest\n\n    env:\n      NEXT_PUBLIC_BASE_PATH: /YOUR_REPOSITORY\n\n    strategy:\n      matrix:\n        node-version: [14.x]\n...\n</code></pre>\n<p>Make sure to replace <em>YOUR_REPOSITORY</em> by your actual repository name.</p>\n<p>Now we are only left to fix the images, since they are being loaded from the <em>public</em> directory, our prefixes don't have any effect there. In order to fix that we will go to the files where we can create a <code>prefix.js</code> file and add the following:</p>\n<pre><code>const prefix = process.env.NEXT_PUBLIC_BASE_PATH || '';\n\nexport { prefix };\n</code></pre>\n<p>Then we just need to import <code>prefix</code> where we are using references to the images and prepend that to the <code>src</code> attribute.</p>\n<pre><code>...\nimport { prefix } from '../../utils/prefix.js';\n...\n    &#x3C;img src={`${prefix}/someimage.jpg`} alt='some alt text' />\n...\n</code></pre>\n<p>Commit and push, and once the action is finished you will be able to see the images and navigate your app!</p>\n<h2>Thanks!</h2>\n<p>Thanks for reading this article! I hope this was helpful and as fun to read as it was to write!</p>\n","title":"Deploy NEXT.JS App to GitHub Pages","date":"2021-04-29"}},"__N_SSG":true}